<!-- -*- mode: markdown; coding: utf-8; fill-column: 60; ispell-dictionary: "english" -*- -->

<meta charset="utf-8"/>
<meta name="viewport" content="width=device-width,initial-scale=1"/>
<link rel="stylesheet" href="style.css">


# EDAF75 - lab 1: SQL

**Objective:** to practice writing SQL queries.

This lab is meant to be run as a `jupyter` notebook, you can
download it [here](lab1.zip) (the zip-file contains the
notebook and the database, and a [.html-file](lab1.html)
which you can read in case you have problems reading/running
jupyter notebooks).

## Background

We have a database to handles the academic achievements of
students at LTH -- in it we have three tables:

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>students:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>ssn</code></td>
  <td>social security number</td>
 </tr>
 <tr>
  <td><code>first_name</code></td>
  <td>first name (obviously!)</td>
 </tr>
 <tr>
  <td><code>last_name</code></td>
  <td>last name</td>
 </tr>
</table>

<hr>

<table rules="all">
 <tr>
  <th align="left"><code>courses:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>course_code</code></td>
  <td>course code, like <code>EDAF75</code></td>
 </tr>
 <tr>
  <td><code>course_name</code></td>
  <td>the name of the course, like "Database Technology"</td>
 </tr>
 <tr>
  <td><code>level</code></td>
  <td>the course level, like "G1", "G2", or "A"</td>
 </tr>
 <tr>
  <td><code>credits</code></td>
  <td>the number of credits for the course, like 7.5</td>
 </tr>
</table>

<hr>

<table rules="all">
 <tr>
  <th align="left"><code>taken_courses:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>ssn</code></td>
  <td>the social security number of a student</td>
 </tr>
 <tr>
  <td><code>course_code</code></td>
  <td>the course code for the course the student has taken</td>
 </tr>
 <tr>
  <td><code>grade</code></td>
  <td>the grade for the student passing the course</td>
 </tr>
</table>

<hr>

<center>
  <img src="lab1.png">
</center>

Some sample data:

```text
ssn           first_name   last_name
---           ----------   ---------
861103–2438   Bo           Ek
911212–1746   Eva          Alm
950829–1848   Anna         Nyström
...           ...          ...

course_code   course_name                   level    credits
-----------   -----------                   -----    -------
EDA016        Programmeringsteknik          G1       7.5
EDAA01        Programmeringsteknik - FK     G1       7.5
EDA230        Optimerande kompilatorer      A        7.5
...           ...                           ...      ...

ssn           course_code   grade
---           -----------   -----
861103–2438   EDA016        4
861103–2438   EDAA01        3
911212–1746   EDA016        3
...           ...           ...
```

The tables have been created with the following SQL
statements:

```sql
CREATE TABLE students (
  ssn          CHAR(11),
  first_name   TEXT NOT NULL,
  last_name    TEXT NOT NULL,
  PRIMARY KEY  (ssn)
);

CREATE TABLE courses (
  course_code   CHAR(6),
  course_name   TEXT NOT NULL,
  level         CHAR(2),
  credits       DOUBLE NOT NULL CHECK (credits > 0),
  PRIMARY KEY   (course_code)
);

CREATE TABLE taken_courses (
  ssn           CHAR(11),
  course_code   CHAR(6),
  grade         INTEGER NOT NULL CHECK (grade >= 3 AND grade <= 5),
  PRIMARY KEY   (ssn, course_code),
  FOREIGN KEY   (ssn) REFERENCES students(ssn),
  FOREIGN KEY   (course_code) REFERENCES courses(course_code)
);
```

All courses offered at the "Computer Science and
Engineering" program at LTH during the academic year 2013/14
are in the table 'courses`. Also, the database has been
filled with made up data. SQL statements like the following
have been used to insert the data:

```sql
INTO   students(ssn, first_name, last_name)
VALUES ('950705-2308', 'Anna', 'Johansson'),
       ('930702-3582', 'Anna', 'Johansson'),
       ('911212-1746', 'Eva', 'Alm'),
       ('910707-3787', 'Eva', 'Nilsson'),
       ...
```

## Assignments

As said above, this lab is designed to be run as a jupyter
notebook. If you haven't got jupyter running, you can run
the sql-commands for the problems below interactively inside
sqlite3, or as a script file with all your commands, or
inside some IDE, like [DB Browser for
SQLite](https://sqlitebrowser.org/).

If you're running the lab as a notebook (and hopefully you
are!), evaluate the following cells before you begin:

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///lab1.sqlite

The tables `students`, `courses` and `taken_courses` are
already in your database, you can see some of their contents
by running the cells below:

In [3]:
%%sql
SELECT  *
FROM    students
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('950705-2308', 'Anna', 'Johansson'),
 ('930702-3582', 'Anna', 'Johansson'),
 ('911212-1746', 'Eva', 'Alm'),
 ('910707-3787', 'Eva', 'Nilsson')]

In [4]:
%%sql
SELECT  *
FROM    courses
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('EDA016', 'Programmeringsteknik', 'G1', 7.5),
 ('EDA031', 'C++ - programmering', 'G2', 7.5),
 ('EDA040', 'Realtidsprogrammering', 'G2', 6.0),
 ('EDA050', 'Operativsystem', 'G2', 4.5)]

In [5]:
%%sql
SELECT  *
FROM    taken_courses
LIMIT   4

 * sqlite:///lab1.sqlite
Done.

[('950705-2308', 'EITN35', 5),
 ('950705-2308', 'ESS050', 3),
 ('950705-2308', 'ETIN70', 4),
 ('950705-2308', 'FMA140', 4)]

If you inadvertently change the contents of the tables, you
can always recreate the them with the following command (it
must be run at the command line):

```sh
sqlite3 lab1.sqlite < create-lab1-data.sql
```

After some of the questions there is a number in brackets.
This is the number of rows generated by the question. For
instance, [72] after question a) means that there are 72
students in the database, you can use that number as an
indicatation of if your answer is in the right ballpark.

a) What are the names (first name, last name) of all the
   students? [72]

In [8]:
%%sql
select first_name, last_name
from students

 * sqlite:///lab1.sqlite
Done.

[('Anna', 'Johansson'),
 ('Anna', 'Johansson'),
 ('Eva', 'Alm'),
 ('Eva', 'Nilsson'),
 ('Elaine', 'Robertson'),
 ('Maria', 'Nordman'),
 ('Helena', 'Troberg'),
 ('Lotta', 'Emanuelsson'),
 ('Anna', 'Nyström'),
 ('Maria', 'Andersson'),
 ('Marie', 'Persson'),
 ('Märit', 'Aspegren'),
 ('Ylva', 'Jacobsson'),
 ('Frida', 'Weidel'),
 ('Caroline', 'Olsson'),
 ('Karolin', 'Ek'),
 ('Eva', 'Hjort'),
 ('Sofia', 'Kjellberg'),
 ('Tina', 'Lööf'),
 ('Lisa', 'Berg'),
 ('Lotta', 'Bergman'),
 ('Susanne', 'Dahl'),
 ('Birgit', 'Ewesson'),
 ('Ulrika', 'Jonsson'),
 ('Jenny', 'Lundin'),
 ('Karin', 'Östberg'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Bo', 'Ek'),
 ('Erik', 'Andersson'),
 ('Erik', 'Andersson'),
 ('Filip', 'Gustavsson'),
 ('Niklas', 'Andersson'),
 ('David', 'Carlsson'),
 ('Tobias', 'Enberg'),
 ('Johan', 'Lind'),
 ('Magnus', 'Pettersson'),
 ('Filip', 'Persson'),
 ('Ola', 'Nilsson'),
 ('Jakob', 'Malmberg'),
 ('Henrik', 'Berg'),
 ('John', 'Lind'),
 ('Patrik', 'Lundh'),
 ('Mikael', 'Nilsson'),
 ('Joakim', 'Nilsson'),
 ('Conny', 'Modig'),
 ('Christian', 'Wallman'),
 ('Magnus', 'Strömgren'),
 ('Daniel', 'Ahlman'),
 ('Lars', 'Molin'),
 ('Magnus', 'Nilsson'),
 ('Anders', 'Olsson'),
 ('Martin', 'Alm'),
 ('Håkan', 'Mossgren'),
 ('Fredrik', 'Ryd'),
 ('Mats', 'Wikström'),
 ('Anders', 'Magnusson'),
 ('Andreas', 'Molin'),
 ('Johan', 'Brattberg'),
 ('Johan', 'Olsson'),
 ('Jonathan', 'Jönsson'),
 ('Magnus', 'Hultgren'),
 ('Axel', 'Nord'),
 ('Henrik', 'Hult'),
 ('Joakim', 'Hall'),
 ('Henrik', 'Gustavsson'),
 ('Torbjörn', 'Modig'),
 ('Daniel', 'Axelsson'),
 ('Per-Erik', 'Pettersson'),
 ('Roger', 'Brorsson'),
 ('Patrik', 'Ohlsson'),
 ('Peter', 'Solberg')]

b) Same as question a) but produce a sorted listing. Sort
   first by last name and then by first name.

In [32]:
%%sql
select last_name, first_name
from students
order by last_name, first_name

 * sqlite:///lab1.sqlite
Done.

[('Ahlman', 'Daniel'),
 ('Alm', 'Eva'),
 ('Alm', 'Martin'),
 ('Andersson', 'Erik'),
 ('Andersson', 'Erik'),
 ('Andersson', 'Maria'),
 ('Andersson', 'Niklas'),
 ('Aspegren', 'Märit'),
 ('Axelsson', 'Daniel'),
 ('Berg', 'Henrik'),
 ('Berg', 'Lisa'),
 ('Bergman', 'Lotta'),
 ('Brattberg', 'Johan'),
 ('Brorsson', 'Roger'),
 ('Carlsson', 'David'),
 ('Dahl', 'Susanne'),
 ('Ek', 'Bo'),
 ('Ek', 'Bo'),
 ('Ek', 'Bo'),
 ('Ek', 'Karolin'),
 ('Emanuelsson', 'Lotta'),
 ('Enberg', 'Tobias'),
 ('Ewesson', 'Birgit'),
 ('Gustavsson', 'Filip'),
 ('Gustavsson', 'Henrik'),
 ('Hall', 'Joakim'),
 ('Hjort', 'Eva'),
 ('Hult', 'Henrik'),
 ('Hultgren', 'Magnus'),
 ('Jacobsson', 'Ylva'),
 ('Johansson', 'Anna'),
 ('Johansson', 'Anna'),
 ('Jonsson', 'Ulrika'),
 ('Jönsson', 'Jonathan'),
 ('Kjellberg', 'Sofia'),
 ('Lind', 'Johan'),
 ('Lind', 'John'),
 ('Lundh', 'Patrik'),
 ('Lundin', 'Jenny'),
 ('Lööf', 'Tina'),
 ('Magnusson', 'Anders'),
 ('Malmberg', 'Jakob'),
 ('Modig', 'Conny'),
 ('Modig', 'Torbjörn'),
 ('Molin', 'Andreas'),
 ('Molin', 'Lars'),
 ('Mossgren', 'Håkan'),
 ('Nilsson', 'Eva'),
 ('Nilsson', 'Joakim'),
 ('Nilsson', 'Magnus'),
 ('Nilsson', 'Mikael'),
 ('Nilsson', 'Ola'),
 ('Nord', 'Axel'),
 ('Nordman', 'Maria'),
 ('Nyström', 'Anna'),
 ('Ohlsson', 'Patrik'),
 ('Olsson', 'Anders'),
 ('Olsson', 'Caroline'),
 ('Olsson', 'Johan'),
 ('Persson', 'Filip'),
 ('Persson', 'Marie'),
 ('Pettersson', 'Magnus'),
 ('Pettersson', 'Per-Erik'),
 ('Robertson', 'Elaine'),
 ('Ryd', 'Fredrik'),
 ('Solberg', 'Peter'),
 ('Strömgren', 'Magnus'),
 ('Troberg', 'Helena'),
 ('Wallman', 'Christian'),
 ('Weidel', 'Frida'),
 ('Wikström', 'Mats'),
 ('Östberg', 'Karin')]

c) What are the names of the students who were born in 1985?
   [4]

In [15]:
%%sql
select ssn,first_name, last_name
from students 
where ssn like '85%'

 * sqlite:///lab1.sqlite
Done.

[('850706-2762', 'Ulrika', 'Jonsson'),
 ('850819-2139', 'Bo', 'Ek'),
 ('850517-2597', 'Filip', 'Persson'),
 ('850208-1213', 'Henrik', 'Berg')]

d) The next-to-last digit in the social security number is
   even for females, and odd for males. List the first names
   of all female students in our database alphabetically
   (each name should occur only once). Hint: the `substr`
   function can be useful. [26]

In [29]:
%%sql
select first_name 
from students
where substr(ssn, 10, 1)%2 = 0
order by first_name

 * sqlite:///lab1.sqlite
Done.

[('Anna',),
 ('Anna',),
 ('Anna',),
 ('Birgit',),
 ('Caroline',),
 ('Elaine',),
 ('Eva',),
 ('Eva',),
 ('Eva',),
 ('Frida',),
 ('Helena',),
 ('Jenny',),
 ('Karin',),
 ('Karolin',),
 ('Lisa',),
 ('Lotta',),
 ('Lotta',),
 ('Maria',),
 ('Maria',),
 ('Marie',),
 ('Märit',),
 ('Sofia',),
 ('Susanne',),
 ('Tina',),
 ('Ulrika',),
 ('Ylva',)]

e) How many students are registered in the database?

In [31]:
%%sql 
select count() as students_registered
from students

 * sqlite:///lab1.sqlite
Done.

[(72,)]

f) Which courses are offered by the department of
   Mathematics (their course codes have the form `FMAxxx`)?
   [22]

In [34]:
%%sql
select course_name, course_code
from courses
where substr(course_code, 1, 3) = 'FMA'

 * sqlite:///lab1.sqlite
Done.

[('Kontinuerliga system', 'FMA021'),
 ('Optimering', 'FMA051'),
 ('Diskret matematik', 'FMA091'),
 ('Matematiska strukturer', 'FMA111'),
 ('Matristeori', 'FMA120'),
 ('Matristeori, projektdel', 'FMA125'),
 ('Geometri', 'FMA135'),
 ('Olinjära dynamiska system', 'FMA140'),
 ('Olinjära dynamiska system, projektdel', 'FMA145'),
 ('Bildanalys', 'FMA170'),
 ('Bildanalys, projektdel', 'FMA175'),
 ('Variationskalkyl', 'FMA200'),
 ('Linjär och kombinatorisk optimering', 'FMA240'),
 ('Datorseende', 'FMA270'),
 ('Datorseende, projektdel', 'FMA272'),
 ('Linjär algebra', 'FMA420'),
 ('Flerdimensionell analys', 'FMA430'),
 ('Endimensionell analys', 'FMAA01'),
 ('Matematik - Funktionsteori', 'FMAF01'),
 ('Matematik - System och transformer', 'FMAF05'),
 ('Tillämpad matematik - Linjära system', 'FMAF10'),
 ('Algebraiska strukturer', 'FMAN10')]

g) Which courses give more than 7.5 credits? [16]

In [36]:
%%sql
select course_name, credits
from courses
where credits > 7.5

 * sqlite:///lab1.sqlite
Done.

[('Coachning av programvaruteam', 9.0),
 ('Datorer i system', 8.0),
 ('Tillämpad mekatronik', 10.0),
 ('Mekatronik, industriell produktframtagning', 10.0),
 ('Digitalteknik', 9.0),
 ('Digitala bilder – kompression', 9.0),
 ('Elektromagnetisk fältteori', 9.0),
 ('Elektronik', 8.0),
 ('Introduktionskurs i kinesiska för civilingenjörer', 15.0),
 ('Introduktionskurs i kinesiska för civilingenjörer, del 2', 15.0),
 ('Fysik', 11.0),
 ('Endimensionell analys', 15.0),
 ('Matematisk statistik, allmän kurs', 9.0),
 ('Realtidssystem', 10.0),
 ('Japanska för tekniker', 15.0),
 ('Industriell ekonomi, allmän kurs', 9.0)]

h) How may courses are there for each level (`G1`, `G2`, and
   `A`)?

In [40]:
%%sql
select level, count()
from courses
group by level

 * sqlite:///lab1.sqlite
Done.

[('A', 87), ('G1', 31), ('G2', 60)]

In the next few problems, we'll look at the results of the
student with the social security number 910101–1234 -- to
make things a lot easier, you can create a `VIEW` with all
his results (see lecture 3).

In [ ]:
%%sql
DROP VIEW IF EXISTS students;
CREATE VIEW student(ssn, first_name, last_name,) AS

i) Which courses (course codes only) have been taken by the
   student with the social security number 910101–1234? [35]

In [ ]:
%%sql

j) What are the names of these courses, and how many credits
   do they give?

In [ ]:
%%sql

k) How many credits has the student taken?

In [ ]:
%%sql

l) Which is the student’s grade average? Try to calculate
both the unweighted and the weighted average.

In [ ]:
%%sql

m) Which students have taken 0 credits? [11] This problem
   can be solved in several ways, first do it with an outer
   join:

In [ ]:
%%sql

Now do the same thing using a subquery:

In [ ]:
%%sql

n) List the names and average grades of the 10 students with
   the highest grade average? You can use the unweighted
   average.

In [ ]:
%%sql

o) List the social security number and total number of
   credits for all students. Students with no credits should
   be included in the listing, with 0 credits (not `NULL`).

   If you do this with an outer join (and I recommend you
   try it!) you might want to use the function
   `coalesce(v1, v2, ...)`; it returns the first value which
   is not `NULL`, so `coalesce(avg(grade), 0)` would give 0
   if the were no grades (i.e., if `grade` were `NULL`), you
   can also try the `ifnull` function.

   (It may be a little bit tricky to get this query right,
   if you're missing the students with 0 credits, don't
   worry, your TA will help you get it right). [72]

In [ ]:
%%sql

p) Is there more than one student with the same name? If so,
   who are these students and what are their social security
   numbers? [7]

   As usual there are several ways of solving this, try to
   solve it using a `WITH`-statement where you create a
   table with all duplicate names, and then use it in a
   `JOIN`:

In [ ]:
%%sql

q) What 5 courses have the highest grade average?

In [ ]:
%%sql